In [1]:
import pandas as pd

In [2]:
data=pd.read_json('employee_data.json')

In [3]:
df=pd.DataFrame(data)

In [4]:
x=df.explode('features')

In [5]:
x

      features
0    candidate
1    candidate
2    candidate
3    candidate
4    candidate
..         ...
495  candidate
496  candidate
497  candidate
498  candidate
499  candidate

[500 rows x 1 columns]

In [55]:
import pandas as pd
import json

with open('employee_data.json') as f:
    data = json.load(f)

# Use pd.json_normalize to convert the JSON to a DataFrame
df = pd.json_normalize(data['features'], 
                     meta=[['candidate','first_name'], ['candidate','last_name'],['candidate','skills'],['candidate','state'],['candidate','specialty'],['candidate','experience'],['candidate','relocation']])

# Rename the columns for clarity
df.columns = ['first_name', 'Last_Name', 'skills', 'state', 'specialty','experience','relocation']

# Display the DataFrame
print(df)

    first_name   Last_Name                                             skills  \
0     Margaret    Mcdonald                [skLearn, Java, R, SQL, Spark, C++]
1      Michael      Carter          [TensorFlow, R, Spark, MongoDB, C++, SQL]
2       Brenda       Tyler                                            [Spark]
3       Joseph        King  [skLearn, SQL, R, Spark, Java, C++, Python, Te...
4        Laura        Webb           [TensorFlow, C++, SQL, Java, R, MongoDB]
..         ...         ...                                                ...
495     Robert       Baker                        [skLearn, Spark, C++, Java]
496      Lucas       Brock                                              [C++]
497   Kimberly  Richardson                                     [Python, Java]
498      Karla     Salazar                   [MongoDB, Python, Java, skLearn]
499       Mrs.       Debra  [skLearn, R, MongoDB, Spark, TensorFlow, Java,...

    state           specialty experience relocation
0      AL            Database        Mid         no
1      AR          Statistics     Senior        yes
2      UT            Database        Mid         no
3      FL    Machine Learning     Senior      maybe
4      WY    Machine Learning     Junior      maybe
..    ...                 ...        ...        ...
495    WA    Machine Learning        Mid        yes
496    AR    Machine Learning     Junior         no
497    IA    Machine Learning     Junior      maybe
498    NE  Data Visualization     Senior        yes
499    TX          Statistics     Senior         no

[500 rows x 7 columns]

In [56]:
df

,first_name,Last_Name,skills,state,specialty,experience,relocation
0,Margaret,Mcdonald,"[skLearn, Java, R, SQL, Spark, C++]",AL,Database,Mid,no
1,Michael,Carter,"[TensorFlow, R, Spark, MongoDB, C++, SQL]",AR,Statistics,Senior,yes
2,Brenda,Tyler,[Spark],UT,Database,Mid,no
3,Joseph,King,"[skLearn, SQL, R, Spark, Java, C++, Python, Te...",FL,Machine Learning,Senior,maybe
4,Laura,Webb,"[TensorFlow, C++, SQL, Java, R, MongoDB]",WY,Machine Learning,Junior,maybe
...,...,...,...,...,...,...,...
495,Robert,Baker,"[skLearn, Spark, C++, Java]",WA,Machine Learning,Mid,yes
496,Lucas,Brock,[C++],AR,Machine Learning,Junior,no
497,Kimberly,Richardson,"[Python, Java]",IA,Machine Learning,Junior,maybe
498,Karla,Salazar,"[MongoDB, Python, Java, skLearn]",NE,Data Visualization,Senior,yes
499,Mrs.,Debra,"[skLearn, R, MongoDB, Spark, TensorFlow, Java,...",TX,Statistics,Senior,no

In [47]:
df=df.to_csv('emmmp2.csv',index=False)

In [27]:
z=df.explode('skills')

In [28]:
z.to_csv('repeated.csv')

In [48]:
df

In [42]:
df

,first_name,Last_Name,skills,state,specialty,experience,relocation
0,Margaret,Mcdonald,"[skLearn, Java, R, SQL, Spark, C++]",AL,Database,Mid,no
1,Michael,Carter,"[TensorFlow, R, Spark, MongoDB, C++, SQL]",AR,Statistics,Senior,yes
2,Brenda,Tyler,[Spark],UT,Database,Mid,no
3,Joseph,King,"[skLearn, SQL, R, Spark, Java, C++, Python, Te...",FL,Machine Learning,Senior,maybe
4,Laura,Webb,"[TensorFlow, C++, SQL, Java, R, MongoDB]",WY,Machine Learning,Junior,maybe
...,...,...,...,...,...,...,...
495,Robert,Baker,"[skLearn, Spark, C++, Java]",WA,Machine Learning,Mid,yes
496,Lucas,Brock,[C++],AR,Machine Learning,Junior,no
497,Kimberly,Richardson,"[Python, Java]",IA,Machine Learning,Junior,maybe
498,Karla,Salazar,"[MongoDB, Python, Java, skLearn]",NE,Data Visualization,Senior,yes
499,Mrs.,Debra,"[skLearn, R, MongoDB, Spark, TensorFlow, Java,...",TX,Statistics,Senior,no

In [43]:
df.to_csv('index.csv')

In [49]:
import psycopg2

In [69]:
def connect():
    try:
        conn = psycopg2.connect(
            dbname="postgres",
            user="postgres",
            password="root",
            host="127.0.0.1",
            port="5432"
        )
        return conn
    except psycopg2.Error as e:
        print("Unable to connect to the database.")
        print(e)
        return None

# Function to create table
def create_table(conn):
    try:
        cur = conn.cursor()
        cur.execute("""
            CREATE TABLE IF NOT EXISTS employee_data (
                first_name TEXT,
                last_name TEXT,
                skills TEXT[],
                state TEXT,
                specialty TEXT,
                experience TEXT,
                relocation TEXT
            );
        """)
        conn.commit()
        cur.close()
    except psycopg2.Error as e:
        print("Error creating table.")
        print(e)

# Function to insert data
def insert_data(conn, data):
    try:
        cur = conn.cursor()
        # Format skills as an array
        skills_arr = "{" + ", ".join(["'{}'".format(skill) for skill in data[2]]) + "}"
        # Insert data into the table
        cur.execute("""
            INSERT INTO employee_data (
                first_name,
                last_name,
                skills,
                state,
                specialty,
                experience,
                relocation
            ) VALUES (%s, %s, %s, %s, %s, %s, %s);
        """, (data[0], data[1], skills_arr, data[3], data[4], data[5], data[6]))
        conn.commit()
        cur.close()
    except psycopg2.Error as e:
        print("Error inserting data.")
        print(e)

# Main function
def main():
    # Connect to PostgreSQL
    conn = connect()
    if conn is None:
        return
    
    # Create table
    create_table(conn)

    # Example data (assuming df is your DataFrame)
      # Replace "your_data.csv" with the path to your CSV file
    for index, row in df.iterrows():
        data = (row['first_name'], row['Last_Name'], row['skills'], row['state'], row['specialty'], row['experience'], row['relocation'])

        insert_data(conn, data)

    # Close connection
    conn.close()

if __name__ == "__main__":
    main()

In [53]:
df

In [62]:
df.columns

Index(['first_name', 'Last_Name', 'skills', 'state', 'specialty', 'experience',
       'relocation'],
      dtype='object')

In [65]:
df.sample

<bound method NDFrame.sample of     first_name   Last_Name                                             skills  \
0     Margaret    Mcdonald                [skLearn, Java, R, SQL, Spark, C++]
1      Michael      Carter          [TensorFlow, R, Spark, MongoDB, C++, SQL]
2       Brenda       Tyler                                            [Spark]
3       Joseph        King  [skLearn, SQL, R, Spark, Java, C++, Python, Te...
4        Laura        Webb           [TensorFlow, C++, SQL, Java, R, MongoDB]
..         ...         ...                                                ...
495     Robert       Baker                        [skLearn, Spark, C++, Java]
496      Lucas       Brock                                              [C++]
497   Kimberly  Richardson                                     [Python, Java]
498      Karla     Salazar                   [MongoDB, Python, Java, skLearn]
499       Mrs.       Debra  [skLearn, R, MongoDB, Spark, TensorFlow, Java,...

    state           specialty experience relocation
0      AL            Database        Mid         no
1      AR          Statistics     Senior        yes
2      UT            Database        Mid         no
3      FL    Machine Learning     Senior      maybe
4      WY    Machine Learning     Junior      maybe
..    ...                 ...        ...        ...
495    WA    Machine Learning        Mid        yes
496    AR    Machine Learning     Junior         no
497    IA    Machine Learning     Junior      maybe
498    NE  Data Visualization     Senior        yes
499    TX          Statistics     Senior         no

[500 rows x 7 columns]>

In [2]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import explode

In [2]:
data={
  "name": "John",
  "age": 30,
  "cars": [
    {"car1": "Ford", "model": "Mustang"},
    {"car2": "BMW", "model": "X5"}
  ]
}

In [3]:
spark = SparkSession.builder.appName('nestedJSON').getOrCreate()

In [6]:
df = spark.read.json('employee_data.json')

In [8]:
df.printSchema()

root
 |-- features: array (nullable = true)
 |    |-- element: struct (containsNull = true)
 |    |    |-- candidate: struct (nullable = true)
 |    |    |    |-- experience: string (nullable = true)
 |    |    |    |-- first_name: string (nullable = true)
 |    |    |    |-- last_name: string (nullable = true)
 |    |    |    |-- relocation: string (nullable = true)
 |    |    |    |-- skills: array (nullable = true)
 |    |    |    |    |-- element: string (containsNull = true)
 |    |    |    |-- specialty: string (nullable = true)
 |    |    |    |-- state: string (nullable = true)

In [9]:
df_flat = df.select(explode('features').alias('Elements'))
df_flat = df_flat.select('Elements.candidate')

df_flat.show()

+--------------------+
|           candidate|
+--------------------+
|{Mid, Margaret, M...|
|{Senior, Michael,...|
|{Mid, Brenda, Tyl...|
|{Senior, Joseph, ...|
|{Junior, Laura, W...|
|{Mid, Cheryl, Ram...|
|{Mid, Charles, St...|
|{Senior, Bradley,...|
|{Mid, William, Li...|
|{Senior, Richard,...|
|{Junior, Robert, ...|
|{Mid, Tanya, Schu...|
|{Senior, Scott, N...|
|{Junior, Brett, H...|
|{Junior, Sean, Wi...|
|{Senior, Steven, ...|
|{Mid, Mr., James,...|
|{Junior, Linda, G...|
|{Junior, Jacob, E...|
|{Mid, Nicole, Mar...|
+--------------------+
only showing top 20 rows

In [10]:
df_flat.printSchema()

root
 |-- candidate: struct (nullable = true)
 |    |-- experience: string (nullable = true)
 |    |-- first_name: string (nullable = true)
 |    |-- last_name: string (nullable = true)
 |    |-- relocation: string (nullable = true)
 |    |-- skills: array (nullable = true)
 |    |    |-- element: string (containsNull = true)
 |    |-- specialty: string (nullable = true)
 |    |-- state: string (nullable = true)

In [15]:
df_flat1=df.select(explode('features.candidate').alias('candi'))
df_flat1 = df_flat1.select('candi.first_name','candi.last_name','candi.experience','candi.relocation','candi.specialty','candi.skills','candi.state')
df_flat1.show()

+----------+---------+----------+----------+------------------+--------------------+-----+
|first_name|last_name|experience|relocation|         specialty|              skills|state|
+----------+---------+----------+----------+------------------+--------------------+-----+
|  Margaret| Mcdonald|       Mid|        no|          Database|[skLearn, Java, R...|   AL|
|   Michael|   Carter|    Senior|       yes|        Statistics|[TensorFlow, R, S...|   AR|
|    Brenda|    Tyler|       Mid|        no|          Database|             [Spark]|   UT|
|    Joseph|     King|    Senior|     maybe|  Machine Learning|[skLearn, SQL, R,...|   FL|
|     Laura|     Webb|    Junior|     maybe|  Machine Learning|[TensorFlow, C++,...|   WY|
|    Cheryl|  Ramirez|       Mid|        no|Data Visualization|[C++, Python, R, ...|   OK|
|   Charles|  Stewart|       Mid|     maybe|  Machine Learning|[MongoDB, C++, Ja...|   NM|
|   Bradley| Peterson|    Senior|       yes|Data Visualization|[skLearn, MongoDB...|   TX|
|   William|      Lin|       Mid|     maybe|  Machine Learning|[Python, skLearn, R]|   WI|
|   Richard|    Woods|    Senior|       yes|          Database|  [skLearn, MongoDB]|   UT|
|    Robert|   Rivera|    Junior|       yes|          Database|[Java, skLearn, P...|   PA|
|     Tanya|  Schultz|       Mid|       yes|        Statistics|[SQL, MongoDB, R,...|   NV|
|     Scott|    Nunez|    Senior|     maybe|          Database|[skLearn, Java, S...|   MO|
|     Brett|  Hoffman|    Junior|        no|          Database|[Java, TensorFlow...|   OK|
|      Sean| Williams|    Junior|        no|Data Visualization|[SQL, MongoDB, R,...|   NV|
|    Steven|    Craig|    Senior|     maybe|Data Visualization|   [TensorFlow, SQL]|   ID|
|       Mr.|    James|       Mid|     maybe|Data Visualization|[TensorFlow, Java...|   KY|
|     Linda|  Griffin|    Junior|        no|        Statistics|[TensorFlow, Spar...|   NE|
|     Jacob| Espinoza|    Junior|     maybe|        Statistics|           [skLearn]|   WV|
|    Nicole|   Martin|       Mid|     maybe|Data Visualization|         [Java, SQL]|   NC|
+----------+---------+----------+----------+------------------+--------------------+-----+
only showing top 20 rows

In [16]:
df_flat1.write.csv("output.csv", header=True, mode="overwrite")

AnalysisException: [UNSUPPORTED_DATA_TYPE_FOR_DATASOURCE] The CSV datasource doesn't support the column `skills` of the type "ARRAY<STRING>".

In [19]:
import pandas as pd

In [30]:
df_flat1.show()

+----------+---------+----------+----------+------------------+-----+--------------------+
|first_name|last_name|experience|relocation|         specialty|state|          skills_str|
+----------+---------+----------+----------+------------------+-----+--------------------+
|  Margaret| Mcdonald|       Mid|        no|          Database|   AL|skLearn,Java,R,SQ...|
|   Michael|   Carter|    Senior|       yes|        Statistics|   AR|TensorFlow,R,Spar...|
|    Brenda|    Tyler|       Mid|        no|          Database|   UT|               Spark|
|    Joseph|     King|    Senior|     maybe|  Machine Learning|   FL|skLearn,SQL,R,Spa...|
|     Laura|     Webb|    Junior|     maybe|  Machine Learning|   WY|TensorFlow,C++,SQ...|
|    Cheryl|  Ramirez|       Mid|        no|Data Visualization|   OK|C++,Python,R,Java...|
|   Charles|  Stewart|       Mid|     maybe|  Machine Learning|   NM|MongoDB,C++,Java,...|
|   Bradley| Peterson|    Senior|       yes|Data Visualization|   TX|skLearn,MongoDB,S...|
|   William|      Lin|       Mid|     maybe|  Machine Learning|   WI|    Python,skLearn,R|
|   Richard|    Woods|    Senior|       yes|          Database|   UT|     skLearn,MongoDB|
|    Robert|   Rivera|    Junior|       yes|          Database|   PA|Java,skLearn,Pyth...|
|     Tanya|  Schultz|       Mid|       yes|        Statistics|   NV|SQL,MongoDB,R,C++...|
|     Scott|    Nunez|    Senior|     maybe|          Database|   MO|skLearn,Java,SQL,...|
|     Brett|  Hoffman|    Junior|        no|          Database|   OK| Java,TensorFlow,C++|
|      Sean| Williams|    Junior|        no|Data Visualization|   NV| SQL,MongoDB,R,Spark|
|    Steven|    Craig|    Senior|     maybe|Data Visualization|   ID|      TensorFlow,SQL|
|       Mr.|    James|       Mid|     maybe|Data Visualization|   KY|TensorFlow,Java,M...|
|     Linda|  Griffin|    Junior|        no|        Statistics|   NE|TensorFlow,Spark,...|
|     Jacob| Espinoza|    Junior|     maybe|        Statistics|   WV|             skLearn|
|    Nicole|   Martin|       Mid|     maybe|Data Visualization|   NC|            Java,SQL|
+----------+---------+----------+----------+------------------+-----+--------------------+
only showing top 20 rows

In [33]:
df.show()

+--------------------+
|            features|
+--------------------+
|[{{Mid, Margaret,...|
+--------------------+

In [37]:
import os

# Unset HADOOP_HOME environment variable
os.environ.pop('HADOOP_HOME', None)

# Save DataFrame as CSV using Pandas
df_flat1.toPandas().to_csv('o.csv', index=False)

In [1]:
import pandas as pd

In [2]:
data=pd.read_json("employee_data.json")

In [4]:
df=pd.DataFrame(data)

In [6]:
df.info

<bound method DataFrame.info of                                               features
0    {'candidate': {'first_name': 'Margaret', 'last...
1    {'candidate': {'first_name': 'Michael', 'last_...
2    {'candidate': {'first_name': 'Brenda', 'last_n...
3    {'candidate': {'first_name': 'Joseph', 'last_n...
4    {'candidate': {'first_name': 'Laura', 'last_na...
..                                                 ...
495  {'candidate': {'first_name': 'Robert', 'last_n...
496  {'candidate': {'first_name': 'Lucas', 'last_na...
497  {'candidate': {'first_name': 'Kimberly', 'last...
498  {'candidate': {'first_name': 'Karla', 'last_na...
499  {'candidate': {'first_name': 'Mrs.', 'last_nam...

[500 rows x 1 columns]>

In [1]:
import pandas as pd

In [3]:
df=pd.DataFrame(data)

In [4]:
df.s

<bound method NDFrame.sample of    name  age                                  cars
0  John   30  {'car1': 'Ford', 'model': 'Mustang'}
1  John   30        {'car2': 'BMW', 'model': 'X5'}>